[{
        "id": 1,
        "title": "The Tabata App",
        "img": "tabata1.png",
        "description": "A simple Tabata application compatible on IOS and Android. My React Native project",
        "tech": ["React Native"],
        "retex": "This project is the first application I coded in React Native. Thanks to him, I was able to learn the basics of React Native and React as well as how IOS Simulator works. I was able to apply my knowledge in ES6 and learn the main elements of react like Hooks.",
        "delivered": "The app is a tabata. It has a countdown, two duration selectors, one for exercise time and one for rest time. It also has a button to go to the countdown page, a start button, a pause button and a reset button. Finally, it has a settings page",
        "githubLink": "https://github.com/enzo-mourany/the-tabata-app.git",
        "date": "2022"
    },
    {
        "id": 2,
        "title": "Lowatem AI",
        "img": "lowatem.png",
        "description": "Project for the IUT. Board game with two opposing players and AI development",
        "tech": ["Java"],
        "retex": "This project allowed me to acquire solid bases in object-oriented programming in Java. I was able to learn to use mostly Classes, Enums and arrays. I learned how some AI algorithms work, in this case the MiniMax algorithm",
        "delivered": "Lowatem is a board game where two players fight using pawns (soldiers) and different weapons. When one of the two days has eliminated all the soldiers of the opposing players, he wins. The AI that I coded makes it possible to beat an opposing player at least 8 times out of 10.",
        "githubLink": "https://github.com/enzo-mourany/ia_lowatem",
        "date": "2022"
    },
    {
        "id": 3,
        "title": "Pong",
        "img": "pong.png",
        "description": "First project for the IUT. Development of the classic pong game with objects, collision, balls and sprites management.",
        "tech": ["Java", "Processing"],
        "retex": "This project allowed me to start Java and learn the basic concepts and algorithms",
        "delivered": "Reproduction of the classic Pong game using the processing tool and Java. We had to implement the game window, the balls and their movements, the rackets and their movements, obstacles, score management and the possibility of playing with 2 or 4 players",
        "githubLink": "https://github.com/enzo-mourany/pong-java-iut",
        "date": "2021"
    },
    {
        "id": 4,
        "title": "Clajem",
        "img": "lowatem.png",
        "description": "Project for the IUT. Creation of an electric skateboard rental and sale business. Realization of the PESTEL analysis and its website. Team project",
        "tech": ["HTML", "CSS"],
        "retex": "This project allowed me to work in a team and manage the sharing of tasks in a group project",
        "delivered": "Creation of a company selling and renting electric skateboards. With my team, we had to carry out the provisional budget, the PESTEL analysis and the description of this company. We then had to create the website to promote our product.",
        "githubLink": "github-link test",
        "date": "2021"
    },
    {
        "id": 5,
        "title": "Storyboard",
        "img": "lowatem.png",
        "description": "Project for the IUT. Creation of an electric skateboard rental and sale business. Realization of the PESTEL analysis and its website. Team project",
        "tech": ["Shell", "HTML"],
        "retex": "Thanks to this project, I was able to learn the basics of Bash and I was able to practice creating more or less complex algorithms",
        "delivered": "It was necessary to create a Bash script allowing to generate HTML pages containing parts of a PDF file converted into PNG and extracts of an audio file",
        "githubLink": "https://github.com/enzo-mourany/storyboard.git",
        "date": "2021"
    },
    {
        "id": 6,
        "title": "Wine Orders",
        "img": "lowatem.png",
        "description": "Project for the IUT. Creation and conception of database to manage wine orders. Team project",
        "tech": ["SQL"],
        "retex": "test",
        "delivered": "",
        "githubLink": "https://github.com/enzo-mourany/wine-commands.git",
        "date": "2022"
    },
    {
        "id": 7,
        "title": "Card Game",
        "img": "lowatem.png",
        "description": "Game of 6 qui prend, with graphical interface windows form",
        "tech": ["C#"],
        "retex": "test",
        "delivered": "",
        "githubLink": "https://github.com/enzo-mourany/card-game-iut.git",
        "date": "2022"
    },
    {
        "id": 8,
        "title": "Client Pop3",
        "img": "lowatem.png",
        "description": "Development of a network interface",
        "tech": ["C#"],
        "retex": "test",
        "delivered": "",
        "githubLink": "https://github.com/enzo-mourany/client-pop3.git",
        "date": "2022"
    }
]
